Repository: fuad888/eurotechbattery
Catalog: locale/*/LC_MESSAGES/django.po
Languages: az

source: Our Story
az: Bizim Hekayəmiz

source: Our Mission
az: Bizim Missiyamız

source: Our Vision
az: Bizim Vizyonumuz

source: Meet Our Team
az: Komandamız ilə tanış olun

source: View Details
az: Detallara bax

source: Contact Us
az: Bizimlə Əlaqə

source: Contact Form
az: Əlaqə formu

source: Submit
az: Təsdiq

source: Contact Details
az: Əlaqə Məlumatları

source: Manufactory
az: İstehsalat

source: Head office
az: Baş Ofis

source: Phone
az: Telefon

source: Frequently Asked Questions
az: Tez-tez verilən suallar

source: View FAQ
az: Tez-tez verilən suallara bax

source: About Our Company
az: Şirkətimiz haqqında

source: Learn More
az: Daha çoxu

source: Truck Batteries
az: Yük maşını akumiliyatorları

source: High-performance batteries designed for heavy-duty trucks and machinery
az: Ağır yük maşınları və mexanizmlər üçün nəzərdə tutulmuş yüksək performanslı akkumulyatorlar

source: Filter Products
az: Məhsulları filteri

source: Category
az: Kateqoriya

source: All
az: Hamısı

source: Price (Min)
az: Qiymət (Az)

source: Price (Max)
az: Qitmət (Çox)

source: Apply
az: Təsdiq

source: Sort by
az: Sıralama

source: Default
az: Sıfırla

source: Price: Low to High
az: Qiymət: Azdan Çoxa

source: Price: High to Low
az: Qiymət: Çoxdan Aza

source: Newest First
az: Ən Yenilər

source: Oldest First
az: Ən Köhnələr

source: Our Products
az: Bizim Məhsullar

source: No products found.
az: Məhsul tapılmadı

source: First
az: Birinci

source: Previous
az: Əvvəlki

source: Next
az: Növbəti

source: Last
az: Sonuncu

source: Title
az: Başlıq

source: Content
az: Kontent

source: Mission
az: Missiya

source: Vision
az: Vizyon

source: Created At
az: Yaradılma

source: Updated At
az: Dəyişdirilmə

source: About
az: Haqqımızda

source: Name
az: Ad

source: Position
az: Vəzifəsi

source: Photo
az: Şəkil

source: Team Member
az: Komanda Yoldaşı

source: Team Members
az: Komanda Yoldaşları

source: The phone number must be in the format +994xxxxxxxxx.
az: Telefon nömrəsi +994xxxxxxxxx bu formatda yazılmalıdır

source: Please select an area of ​​interest.
az: Maraqaqlandığınız sahıni seçin

source: The selected option is incorrect.
az: Düzgün seçim etmədiniz

source: Message
az: Mesaj

source: Products
az: Məhsullar

source: Services
az: Servislər

source: Support
az: Dəstək

source: Other
az: Digər

source: Home
az: Ana səhifə

source: Contact
az: Əlaqə

source: Partnering with Technology Leaders:
az: Texnologiya Liderləri ilə Birgə:

source: Helpfull Links
az: Köməkçi Linklər

source: Home
az: Ana Səhifə

source: About us
az: Bizim Haqqımızda

source: Azerbaijani
az: Azərbaycan

source: English
az: İngilis

source: Russian
az: Rus
